# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'htop'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'tree'
brew 'tmux'
brew 'zsh'
brew 'zsh-completions'
brew 'openldap'
brew 'libiconv'

# Development
brew 'mysql'
brew 'node'
brew 'php@7.1'
brew 'php@7.2'
brew 'php@7.3'
brew 'brew-php-switcher'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'alfred'
cask 'phpstorm'
cask '1password'
cask 'sip'
cask 'dropbox'
cask 'sequel-pro'
cask 'iterm2'
cask 'spotify'
cask 'franz'
cask 'vlc'
cask 'whatsapp'
cask 'teamviewer'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'vagrant'
cask 'java'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'insomnia'
cask 'atom'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'The Unarchiver', id: 425424353
